Repository: Sportclub-Schneisingen/azure-sso-wordpress-plugin
Catalog: src/languages/azure-sso-*.po
Languages: de_de

source: Allows users to log in to WordPress using Microsoft Entra ID SSO.
de_de: Erlaubt es Benutzern sich mit ihrem Microsoft Konto bei WordPress anzumelden.

source: Sign in with Microsoft Entra ID
de_de: Mit Microsoft Entra ID anmelden

source: Azure SSO Settings
de_de: Azure SSO Einstellungen

source: Azure SSO is not fully configured. SSO will not work.
de_de: Azure SSO nicht konfiguriert. SSO wird nicht funktionieren.

source: Configure Azure SSO
de_de: Azure SSO konfigurieren

source: Settings
de_de: Einstellungen

source: General Options
de_de: Allgemeine Optionen

source: Configure client ID, client secret and tenant ID. Get them from your Microsoft Entra ID app registration.<br> Add <code>%s</code> as the redirect URL to the app registration.
de_de: Anwendungs-ID (Client ID), geheime Clientschlüssel (Client Secret) und Mandanten-ID (Tenant ID) einstellen. Diese Werte sind in der App-Registrierung ersichtlich.<br> Fügen Sie <code>%s</code> als Umleitungs-URI hinzu.

source: Login Page Options
de_de: Optionen für die Anmeldeseite

source: Configure the login page behavior or style the login page button.
de_de: Verhalten der Loginseite und Stil des Login-Knopfes einstellen.

source: Advanced Options
de_de: Erweiterte Optionen

source: Configure advanced options for SSO here.
de_de: Erweiterte Optionen des Plugins hier einstellen.

source: Client ID
de_de: Anwendungs-ID

source: Client Secret
de_de: Geheimer Clientschlüssel

source: Tenant ID
de_de: Mandanten-ID

source: Login Button Text
de_de: Text für Login-Knopf

source: Use POST Requests
de_de: POST-Anfragen verwenden

source: Auto Redirect
de_de: Automatisch weiterleiten

source: An error occurred during SSO login.
de_de: Während dem SSO-Anmeldeversuch ist ein Fehler aufgetreten.

source: The authorization code or state is missing.
de_de: Autorisierungscode oder Status fehlen.

source: The nonce is missing.
de_de: Die Nonce fehlt.

source: The nonce is invalid.
de_de: Die Nonce ist ungültig.

source: The response from the server was empty.
de_de: Die Antwort vom Server ist leer.

source: Your account has not been registered on this site.
de_de: Dieses Konto wurde auf dieser Seite noch nicht registriert.

source: Login was successful, but site did not accept user.
de_de: Die Anmeldung war erfolgreich, aber die Seite hat den Benutzer nicht akzeptiert.

source: Azure SSO is not configured correctly. Check configuration and try again.
de_de: Azure SSO ist nicht korrekt konfiguriert. Bitte überprüfen Sie die Konfiguration und versuchen Sie es erneut.

source: Azure SSO Error
de_de: Azure SSO Fehler

source: or sign in using single-sign-on
de_de: oder mit Single-Sign-On anmelden
